# ZoneElementDomainData Class

---
A base class for specific domain requirements for a zone.
SystemObject Autodesk.Revit.DB.MechanicalZoneElementDomainData Autodesk.Revit.DB.ElectricalAreaBasedLoadData
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ZoneElementDomainData : IDisposable

    Public Class ZoneElementDomainData
    	Implements IDisposable

    public ref class ZoneElementDomainData : IDisposable

    type ZoneElementDomainData =
        class
            interface IDisposable
        end
The ZoneElementDomainData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ZoneElementDomainData
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Mechanical Namespace